---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures
source: html/db1df14a-6e8a-c61b-9954-85c5f01bb84f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures

Failures about Interference.

## Syntax (C#)
```csharp
public static class InterferenceFailures
```